cf/Documents/ОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ОприходованиеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентаризацияТМЦ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ОприходованиеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекДанные.Количество <> 0 Тогда
		ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)	
	
	НомерСтроки = Элементы.Товары.ТекущиеДанные.НомерСтроки;
	ТоварыНоменклатураПриИзмененииНаСервере(НомерСтроки);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.Партия = Неопределено;
		ТоварыНоменклатураПриИзмененииНаСервере(Элемент.ТекущиеДанные.НомерСтроки);	
	КонецЕсли;	
	
	Если Элемент.ТекущийЭлемент.Заголовок = "Партия" Тогда
		ТоварыПартияОткрытие(Элемент, Ложь)
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрыФормы(ТекСтр)
	
	ЗначенияОтборов = Новый Структура;
	ЗначенияОтборов.Вставить("Владелец",     ТекСтр.Номенклатура);
	ЗначенияОтборов.Вставить("Организация",  Объект.Организация);
	ЗначенияОтборов.Вставить("Склад",        Объект.Склад);	
	ЗначенияОтборов.Вставить("ДатаОстатков", Объект.Дата);
	
	ПараметрыФормы = Новый Структура("Ключ", ТекСтр.Партия);
	ПараметрыФормы.Вставить("Отбор",         ЗначенияОтборов);

	Возврат ПараметрыФормы;
	
КонецФункции 

&НаКлиенте
Процедура ДвиженияПартииТоваровПартияОткрытие(Элемент, СтандартнаяОбработка)  	
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = СформироватьПараметрыФормы(Элементы.ДвиженияПартииТоваров.ТекущиеДанные);
	ОткрытьФорму("Справочник.Партии.Форма.ФормаЭлементаОткрыть", ПараметрыФормы, Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПартияОткрытие(Элемент, СтандартнаяОбработка)  	
	
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = СформироватьПараметрыФормы(Элементы.Товары.ТекущиеДанные);
	ОткрытьФорму("Справочник.Партии.Форма.ФормаЭлементаОткрыть", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(НомерСтроки)
	
	ДанныеСтроки = Объект.Товары[НомерСтроки-1];
	
	Если ЗначениеЗаполнено(ДанныеСтроки.Партия) Тогда
		ДанныеСтроки.Партия.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		ДанныеСтроки.Партия = Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеСтроки.Номенклатура) Тогда
		ДанныеСтроки.Партия = Справочники.Партии.СоздатьНовуюПартию(ДанныеСтроки.Номенклатура).Ссылка;
		ДанныеСтроки.ЕдиницаИзмерения = ДанныеСтроки.Номенклатура.ЕдиницаИзмерения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда // ЭтоНовый
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоИнвентаризации(Команда)
	
	Если не ЗначениеЗаполнено(Объект.ИнвентаризацияТМЦ) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен документ инвентаризации";
		Сообщение.Поле = "ИнвентаризацияТМЦ";
		Сообщение.ПутьКДанным = "Объект";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда
		
		ОбработкаОтвета = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтотОбъект);
		ПоказатьВопрос(ОбработкаОтвета, "Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоИнвентаризацииНаСервере();
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПользователя(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоИнвентаризацииНаСервере();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПоИнвентаризацииНаСервере()
	
	Объект.Товары.Очистить();
	
	Для каждого СтрокаТЧ из Объект.ИнвентаризацияТМЦ.Товары Цикл
		
		Если СтрокаТЧ.Количество > СтрокаТЧ.КоличествоУчет Тогда 
			
			СтрокаОприходования = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаОприходования, СтрокаТЧ);
			СтрокаОприходования.Количество = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоУчет;
			СтрокаОприходования.Сумма = СтрокаОприходования.Количество * СтрокаТЧ.Цена;
			
		КонецЕсли;
		                                                                                   		
	КонецЦикла;
	
КонецПроцедуры
